tutorials/untested/pimpleFlasks/0.org/H2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      H2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

// internalField   uniform 0.0001;
internalField   uniform 0.5;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.5;
    }
    frontAndBack
    {
        type            empty;
    }
    "(sphere|sphere2|cyl)"
    {
        type            zeroGradient;
    }

    "(outlet|sides)"
    {
        // type        zeroGradient;
        // type            fixedValue;
        // value           uniform 0.9;
        type            fixedValue;
        value           uniform 0.65;
        // value           uniform 0.9;
        // type uniformFixedValue;
        // uniformValue table
        // (
        //     (0 0.5)
        //     (1000 0.55)
        // )
    }
    "sym"
    {
        type        symmetry;
    }
}

// ************************************************************************* //
