tutorials/untested/pimpleFlasks/0.org/acetone
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      CO;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.319;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.319;
    }

    "(sphere|sphere2|cyl)"
    {
        type            zeroGradient;
    }
    
    frontAndBack
    {
        type            empty;
    }

    "(outlet|sides)"
    {
        // type        zeroGradient;
        type            fixedValue;
        // value           uniform 0.2;
        // value           uniform 0.0;
        value           uniform 1e-8;
        // type uniformFixedValue;
        // uniformValue table
        // (
        //     (0 0.5)
        //     (1000 0.45)
        // )
    }
    "sym"
    {
        type        symmetry;
    }
}

// ************************************************************************* //
