tutorials/untested/pimpleFlasks/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            totalPressure;
        p0              uniform 101325;
        value           uniform 101325;
    
        U               U;
        phi             phi;
    }

    sphere2
    {
        type            totalPressure;
        p0              uniform 101325;
        value           uniform 101325;
    
        U               U;
        phi             phi;
    }

    "(sphere|cyl)"
    {
        type            zeroGradient;
        // type            totalPressure;
        // p0              uniform 101325;
        // value           uniform 101325;
    
        // U               U;
        // phi             phi;
    }
    "(sides)"
    {
        type            zeroGradient;
    }
        frontAndBack
    {
        type            empty;
    }
        "sym"
    {
        type        symmetry;
    }
}

// ************************************************************************* //
