tutorials/untested/pimpleFlasks/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//application     reactingHetCatSimpleFoam;
//application     reactingHetCatSimpleFoamSM;
//application     reactingHetCatSimpleFoamFC;
application     reactingHetCatPimpleFoamFC;

startFrom       startTime;

startTime 	0;

stopAt          endTime;

endTime	300;

deltaT          0.01;

writeControl    adjustableRunTime;

// writeInterval 	500;
writeInterval 	10;
//writeInterval 	1;
// writeInterval 	10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo          0.5; 


// ************************************************************************* //

functions
{
      #include "residuals"
}
