tutorials/untested/pimpleFlasks/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name reactingCells;
        type cellSet;
        action new;
        source boxToCell;
        // sourceInfo
        // {
        //     p1 (0 0 -1e-2);
        //     p2 (0 0 0e-2);
        //     innerRadius 2e-3;
        //     outerRadius 6e-3;
        // }
        box (-1 -1 0.08) (1 1 0.225);
    }
    {
        name    reactingCellZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set reactingCells;
        }
    } 
    {
        name 	sphere2;
        type	faceSet;
        action 	new;
        source	patchToFace;
        sourceInfo
        {
            name	sphere;
        }
    }
    {
        name 	toDel2;
        type 	faceSet;
        action 	new;
        source	boxToFace;
        sourceInfo
        {
            //~ box (-0.048 -0.1235 0.0015)(-0.045 0.1235 0.2485); 
            box (-1 -1 -1)(1 1 0.38);
        }
    }
    {
        name 	sphere2;
        type	faceSet;
        action	delete;
        source	faceToFace;
        sourceInfo
        {
            set toDel2;
        }
    }
);

// ************************************************************************* //
